StoveOpt/tests/test_results/case_4722222222/0/details
Velocity
47.22222222